init.org
* The main file (~init.el~)
:PROPERTIES:
:tangle:   init.el
:END:

Load the path with configuration files.
#+BEGIN_SRC elisp
(add-to-list 'load-path "~/.emacs.d/lisp")
#+END_SRC

Customize built-in features.
#+BEGIN_SRC elisp
(load-library "init-startup.el")
(load-library "init-general.el")
(load-library "init-visual.el")
(load-library "init-text.el")
(load-library "init-os.el")
(load-library "init-python.el")
(load-library "init-latex.el")
#+END_SRC

Add extra packages, either from repositories or from local subfolders.
#+BEGIN_SRC elisp
  ;; * Extra packages
  ;; ** from repositories
  (setq package-list '(company
                       helm
                       yasnippet
                       expand-region
                       multiple-cursors
                       org
  ;;                     org-redmine
                       org-pomodoro
                       org-bullets
  ;;                     org2blog
  ;;                     websocket
  ;;                     ein
  ;;                     bm
                       zotelo
  ;;                     simple-httpd
  ;                     js2-mode
  ; ;                    skewer-mode
  ;                     exec-path-from-shell
                       projectile
                       helm-projectile
                       transpose-frame
                       elpy
  ;                     spray
                       ;image+
  ;                     eimp
                       auctex
                       cdlatex
                       latex-preview-pane
                       ;org-beautify-theme
   ;                    android-mode
  ;                     neotree
                       auctex-latexmk
                       toc-org
  ;                     anaconda-mode
  ;                     company-anaconda
  ))
  ;; ** from local subfolders 
  (setq other-package-list '(thing-edit
                             gams
                             ox-wk
                             ;matlab
                             ;speedread
                             org-checklist
                             ))
  (load-library "init-packages.el")
#+END_SRC
